## 1. Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

#def sqr(a, b):
#    n=1
#    for i in range(b):
#        n*=a
#        i+=1
#    return n
#
#a = int(input('Введите число '))
#b = int(input('Введите степень '))
#print(sqr(a, b))

# 2. Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

def recursive_sum(a, b):
    if a == 0:
        return b
    else:
        return recursive_sum(a - 1, b + 1)

a = int(input("Введите первое неотрицительное число "))
b = int(input("Введите второе неотрицательно число "))
print(recursive_sum(a, b))

